Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K39.tmx
Source language: en_us
Languages: zh_cn

source: Onward
zh_cn: 向前

source: caroline always prepares Fred's breakfast herself.
zh_cn: Caroline总是亲自为Fred准备早餐。

source: Her young brother's looking sallow around the eyes.
zh_cn: 她这位弟弟眼周散发着蜡黄的颜色。

source: "We saved you the last of the kippers," she says, in a tone airy enough to give the impression that she and Pet had their fill of kippers before he came down this morning.
zh_cn: “我们给你留了最后一块熏鱼，”她轻描淡写的说着，让人觉得他今早下楼前，她们刚吃完了自己那份熏鱼。

source: Mouth full, Fred sings to his niece in his surprising bass.
zh_cn: Fred满嘴吃的，用他那出人意料的低音对他的侄女哼唱着这首歌。

source: Pet giggles at the face he's pulling.
zh_cn: Pet扯着她叔叔的脸咯咯笑着。

source: Caroline slides her last triangle of toast the child's way.
zh_cn: Caroline把最后一块三角土司推给孩子。

source: Pet's worn that striped frock since spring.
zh_cn: Pet自打春天开始就一直穿着这件条纹连衣裙了。

source: Is she undersized, for two years old?
zh_cn: 对于两岁的孩子来说，她个子是不是太小了？

source: But then, girls are generally smaller.
zh_cn: 不过女孩一般都比较小。

source: Are the children Caroline sees thronging the parks so twig-like, under their elaborate coats?
zh_cn: Carolilne想想那些在公园看到的成群的孩子们，在精致的外衣底下，他们是不是也这么瘦弱呢？

source: "Where did you pick that one up?" she asks Fred.
zh_cn: “你在哪学会这歌的？”她问Fred。

source: "A fellow at the office."
zh_cn: “跟办公室里一个人学的。”

source: "Again, again," insists Pet: her new word this week.
zh_cn: “又是，又是，”Pet一直念叨着这周新学的词。

source: Caroline catches herself watching the clock.
zh_cn: Caroline发现自己一直在看表。

source: Fred launches into song again as he rises to his feet and brushes the crumbs from his waistcoat with a manner oddly middle-aged, for twenty-three.
zh_cn: Fred站起来，用一种不符合23岁年华的大叔范儿拍了拍马甲上的面包屑，又唱了起来。

source: "Come, now, Pet, let Uncle get his coat on."
zh_cn: “来吧Pet，让叔叔把外套穿上。”

source: Fred mustn't be late, but that's not it: Caroline wants him gone, so she can tackle the day.
zh_cn: Fred不能迟到，但不是因为这个；Caroline希望他快走，然后她才能开始解决掉这一天。

source: The child, windmill-armed, slaps imaginary dust out of her uncle's trousers while her mother adjusts his collar.
zh_cn: Pet张开双臂，拍掉叔叔裤子上的隐形灰尘，她的妈妈帮叔叔弄好领子。

source: Not that he has any real prospect of advancement from the ranks of draftsmen, but still, no harm in looking dapper.
zh_cn: 倒不是说他的绘图员职业有多美好的前景，但整洁点还是没害处的。

source: She nearly made an architect of him, so very nearly; another few years would have done it.
zh_cn: 她差点让弟弟成为建筑师，就差一点点；再过几年也许就能成了。

source: Nearly never knit a sock, as their mother used to say in sober moments.
zh_cn: 就像他们的妈妈清醒的时候所说，“差一点”可织不成一只袜子。

source: "Bye-bye," chants Pet, "bye-bye, bye-bye."
zh_cn: “拜拜，” Pet不停的喊着“拜拜，拜拜。”

source: Fred always leaves to catch his omnibus with a cheerful expression.
zh_cn: Fred总是高高兴兴的去搭他的公交车。

source: Does he like his work, she wonders?
zh_cn: 她在想，他真的喜欢这份工作么？

source: Or just put a brave face on it for thirty-five shillings a week?
zh_cn: 还是只为了拿到35先令的周薪强颜欢笑呢？

source: Caroline carries the tray down to the kitchen and leaves the dishes for the girl.
zh_cn: Caroline把托盘拿到厨房，把盘子留给了Pet。

source: Pet drops a saucer, but by some miracle it only spins loudly on the tiles.
zh_cn: Pet掉了个茶碟，茶碟奇迹般的没有摔碎在地砖上。

source: Upstairs, to do the beds together, shaking out the blankets; Caroline straightens everything as soon as her daughter's back is turned.
zh_cn: Caroline在楼上整理床铺抖毯子，在女儿转过来前就整理好一切。

source: Then down to the parlor again, where she takes up her mending while Pet wreaks havoc in the sewing box.
zh_cn: 然后又来到客厅缝补衣服，这时候Pet就会在针线盒里捣乱。

source: The room is cooling down as the fire goes gray.
zh_cn: 火黯淡下来，客厅慢慢转凉。

source: Fred needs new cuffs. These ones are so frayed, it would be throwing good thread after bad to darn them.
zh_cn: 得给Fred换一对新袖口了，现在的都磨坏了，要想补好反而得不偿失。

source: Or that's her excuse; Caroline's fingers are stupid with the needle.
zh_cn: 又或许这只是她的借口；Caroline不太会用针。

source: Her little brother, her charge and her pride, and she sends him out every day a bit shabbier.
zh_cn: 她每天送出门的弟弟，虽然穿着不光鲜，但却是她的一切她的骄傲。

source: Toast crumbs still gritty in her throat, and already Caroline is reviewing the contents of the pantry, brooding over lunch.
zh_cn: 早餐的面包屑还堵在嗓子眼，Caroline就已经开始琢磨食材寻思午饭了。

source: The remains of yesterday's beef?
zh_cn: 吃昨天的剩牛肉？

source: "What a tall tower," she marvels, watching Pet set another spool on top of the quivering structure.
zh_cn: Caroline看着Pet在颤巍巍的线轴堆顶上又放了一个，惊叹道“好高的塔啊。”

source: Spools crash and roll across the room.
zh_cn: 然后塔倒了，线轴滚的到处都是。

source: Caroline jumps, pricks herself. "Pick up now," is all she lets herself say, sucking her finger.
zh_cn: Caroline跳起来，扎到了自己，一边喊着“捡起来吧”一边吮着手指。

source: "Good girl," she cries when her daughter produces the last dust-rimmed spool from under the table.
zh_cn: Pet从桌子底下捡起最后一个沾满灰的线轴，她喊道“好孩子”。

source: Is false cheer better than none, she wonders?
zh_cn: 她想，强颜欢笑起码聊胜于无吧？

source: So much of motherhood is acting.
zh_cn: 这就是母爱啊。

source: Usually she manages to get Pet down to sleep by noon, when the girl comes in to mind her, but today Pet is wound up, squeaking in her own private language, rattling buttons in the tin.
zh_cn: 平时一到中午她就会哄Pet睡觉，但今天Pet很兴奋，一边玩着罐子里的扣子，一边吱吱呀呀的自言自语。

source: A confident knock at the door.
zh_cn: 这时响起一阵坚定的敲门声。

source: Early, how can he be this early, before the maid's even got here?
zh_cn: 真早，他怎么会这么早，比女仆来的还早？

source: What makes him believe, what gives him the right - Anger tightens the drawstrings of Caroline's face.
zh_cn: 他以为他是谁，凭什么—Caroline生气的绷紧脸。

source: "A visitor for Mamma!
zh_cn: “妈妈有客人来了！

source: Would you like to sit here quiet as a mouse and play with Mamma's jewels?"
zh_cn: 你能像个小老鼠一样安静地坐在这玩妈妈的首饰么？”

source: Before she's finished speaking she's thundering up to her room, taking the stairs two at a time, Pet stumbling in her wake.
zh_cn: 她还没说完就已经冲向自己的房间，一步并作两步的上了楼梯，Pet还迷迷糊糊的。

source: She grabs the box from her dressing table.
zh_cn: 她从梳妆台拿上珠宝盒。

source: The second knock, still sprightly.
zh_cn: 敲门声再次骤然响起。

source: He'll wait, won't he? Surely he'll give her a minute to get to the blasted door -
zh_cn: 他能等会儿对吧？他肯定得等她走到那该死的门口——

source: As she reaches the hall again, passing the struggling child on the stairs, her skirt almost knocks Pet over; Caroline takes the child's small hand and pulls her into the parlor.
zh_cn: 她走过楼梯，裙子差点把楼梯上的Pet绊倒，又来到了走廊；Caroline抓着孩子的小手，把她带到客厅。

source: She's breathing hard as she sets the jewelry box down on the sofa.
zh_cn: 她把珠宝盒放在沙发上，喘着粗气。

source: Pet's mouth forms an O of ecstasy.
zh_cn: Pet看了高兴的嘴都张圆成了O形。

source: All that's left are cheap necklaces and bracelets in glass and jet, probably easy enough to break, but then again, not valuable enough to matter.
zh_cn: 盒子里剩的都是一些不值钱的项链和手链，玻璃的煤玉的，一摔就碎，但是不值钱，碎了也就碎了。

source: "Be good now, Pet."
zh_cn: “听话Pet。”

source: Good, what does that mean to a two-year-old whose every natural urge is to poke, to grab, to take the world in her fists and shake the secrets out of it?
zh_cn: 听话，对于一个两岁的孩子来说算什么呢，他们正是到处戳，到处抓的时候，恨不得把世界握在手里，把所有的秘密都摇出来。

source: The fire - Caroline slams the guard across it.
zh_cn: 火-Caroline关上了围栏。

source: "Mamma back soon!"
zh_cn: “妈妈这就回来！”

source: The third knock hammers as she's dashing through the hall; she pauses to shake her skirts into shape.
zh_cn: 她穿过走廊，敲门声第三次响起；她停下来整了整衣服。

source: Her smiling apologies overlap with his.
zh_cn: 两人都遇上了彼此歉意的微笑。

source: This one's all bluff humor and compliments; he's brought what he calls a mere token.
zh_cn: 这个人带着直率的幽默和恭维；他自称带来的东西只是意思意思。

source: Caroline stares at the miniature lilies, hides her face in their white stiffness.
zh_cn: Caroline看着小小的百合花，把脸埋进了硬挺的花丛。

source: The scent is sweet enough to hurt her throat.
zh_cn: 花太香，呛嗓子。

source: Eerie white bugles, suited to a girl's coffin.
zh_cn: 诡异的白色花束，正适合装点女孩的棺材。

source: This late in the autumn, they must be hothouse blooms: she reckons the cost.
zh_cn: 深秋至此，这花肯定是温室培育的；她在脑子里盘算着价钱。

source: "Mamma!"
zh_cn: “妈妈！”

source: Pet, lurching into the hall, heavy with necklaces.
zh_cn: Pet戴着沉甸甸的项链，摇晃着来到走廊。

source: "Stay in the parlor," says Caroline, picking her up, crushing her against the flowers. She plants her on the sofa again, and in the small perfect ear, very low and fierce, she says "Shh!"
zh_cn: “呆在客厅里，”Caroline说道，拿着花抱起她，带回到沙发上，在她小巧完美的耳边，低声严厉的“嘘”。

source: Turns to find the visitor leaning in the doorway, grinning as if to demonstrate that he doesn't mind encountering the little one, on the contrary in fact.
zh_cn: 转过头来，发现来人靠在门边微笑着，表明自己非但不介意小孩，反而愿意看到。

source: It occurs to her that he's scanning Pet's features, and her stomach turns.
zh_cn: Caroline想到他在打量着Pet，心下一紧。

source: "Piddy," remarks Pet, caressing one glacial petal.
zh_cn: “Piddy，”Pet摸着冰冷的花瓣说道。

source: What's a pity?
zh_cn: 什么可惜了？

source: How does the child know about pity?
zh_cn: 孩子怎么会懂怜悯？

source: Oh, pretty.
zh_cn: 哦，她说的是漂亮。

source: Caroline yanks the bouquet away.
zh_cn: Caroline把花束拿走。

source: "Yes, Mamma's special pretty flowers, don't touch."
zh_cn: “是啊，妈妈的漂亮花，别碰。”

source: Upstairs, she chats a bit, marvels at how long her visitor's mustache is getting.
zh_cn: 楼上，他们聊了聊，她惊叹于来人的胡子已经这么长了。

source: Has he had a very tiresome morning in the City?
zh_cn: 他是不是在城里度过了疲惫的上午呢。

source: He's considering investing in the Canadian Grand Trunk Railway, well, hasn't that quite a ring to it.
zh_cn: 他正在考虑投资加拿大干线铁路，呵，听着多么耳熟。

source: The sheets have a damp feel against her back, though Caroline tells herself she must be imagining it.
zh_cn: 后背下的床单感觉潮乎乎的，Caroline告诉自己肯定是错觉。

source: She moves the way he prefers, with her ears always pricked.
zh_cn: 她随他的喜好而动，只是一直竖起耳朵。

source: Nothing, not a sound.
zh_cn: 没声音，什么声音都没有。

source: Could Pet have crept upstairs, might she be outside Mamma's bedroom door right now, plucking up her nerve to push the door open?
zh_cn: Pet会不会爬上楼梯，会不会就在妈妈的门前，鼓起勇气推开房门？

source: No, no, Caroline would have heard something, one of those little gasps of exertion or nonsense words a two-year-old can't help making.
zh_cn: 不，不，Caroline肯定能听到什么的，一个两岁的孩子肯定会发出喘息或者依依呀呀的声音。

source: But the man has put his oily mustache to her ear now, he's grunting like a seal.
zh_cn: 但是这个男人现在把油乎乎的胡子放在她耳边，像海豹一样发出呼噜声。

source: She can't hear anything else.
zh_cn: 她什么都听不到。

source: She should be making those delicate bird-cries he likes but oh god, what if a necklace has snagged, tightened round Pet's soft throat?
zh_cn: 她本应该发出他喜欢的娇弱尖叫，但天哪，如果项链挂住，绕紧在Pet纤细的喉咙上怎么办？

source: Earrings, she forgot to take the damn earrings out of the box.
zh_cn: 还有耳环，她忘了把耳环从盒子里拿走了。

source: What would one of those tiny sharp hooks do to a small stomach? Her fingers clamp on the pale meat of his shoulders.
zh_cn: 上面尖利的钩子到胃里会怎么样？她的手指紧抓着他苍白的肩膀。

source: Hurry, hurry, do your business and be done with it.
zh_cn: 快点，快点，赶快完事走人。

source: "Oh, sweet Caroline," he groans.
zh_cn: “哦，美丽的Caroline，”他呻吟道。

source: A rage spirals up when she hears him use her name, a coal-smoke whirlwind wrenching this scarecrow out of her, hurling him against the walls, whipping him through the pealing glass to fall like rag 'n' bones on the Brompton street, where the next passing carriage will flatten his face into stone and mud.
zh_cn: 听到他叫了自己的名字，她心中升腾起一股愤怒，把这个瘦小枯干从体内拔出，摔到墙上狠抽一顿，破窗而出像垃圾一样扔到布朗普顿大街上，随后被马车碾过陷入泥土。

source: A small sound brings her back to herself.
zh_cn: 细小的声响让她回了神。

source: Rocking away on top of her, the visitor doesn't notice, but Caroline can make out voices in the parlor, one deeper than the other.
zh_cn: 在她身上晃个不停的来人一点没注意到，但Caroline能分辨出客厅的声音，声声入耳。

source: The girl at last, ten minutes late by the clock on the dresser.
zh_cn: 结果女佣比衣柜上的表晚来了10分钟。

source: It's all right.
zh_cn: 没事了。

source: Pet's all right.
zh_cn: Pet一切都好。

source: Caroline's teeth unlock.
zh_cn: Caroline松了牙关。

source: Love fizzes like acid in her bones. She doesn't have to fake that.
zh_cn: 爱像在骨头里泛着酸，这可是装不出来的。

source: Lunch is the last of the beef, in a soup, bulked out with turnips.
zh_cn: 午饭是剩牛肉，和着萝卜做成汤。

source: Pet pushes her bowl away, but Caroline puts the spoon between the little pink lips over and over.
zh_cn: Pet把碗远远推开，Caroline就一勺一勺的喂她。

source: Though the child hasn't had her nap, Caroline takes her out, while the rain is holding off.
zh_cn: 虽然Pet还没睡过，但是Caroline还是带她出去了，雨还是一直没下。

source: "Pam pam," wails Pet.
zh_cn: “车车”，Pet哭闹着。

source: Her memory is getting longer; the pram was pawned three weeks ago.
zh_cn: Caroline陷入回想，手推车三周前就当掉了。

source: (Uncle Fred doesn't seem to have noticed.)
zh_cn: （Fred舅舅似乎毫无察觉）

source: "You're a great big girl now, you can walk," says Caroline, with one of those smiles that are too hard around the edges.
zh_cn: “你是个大姑娘了，可以走着去。”Caroline说道，带着用力过猛的笑容。

source: Pet wanders in long spirals, trips over a pinecone.
zh_cn: Pet转着圈，被松果绊到。

source: "Come along, my sweet. This way."
zh_cn: “跟我来甜心，这边走。”

source: The air's bad today, damp and sulfurous.
zh_cn: 今天空气又潮又差。

source: "On we go!" After a minute, Caroline dips to lift her daughter onto her hip.
zh_cn: “走喽”一分钟后，Caroline低下去把女儿抱起来。

source: When they reach Brompton Park, Pet struggles to get down and chases sparrows with the lumbering merriment of a drunk.
zh_cn: 到了布朗普顿公园，Pet挣脱下来，喝醉了似的笨重的追着燕子。

source: She coughs with excitement, picks up a branch covered in curled yellow leaves, and shakes it like a standard.
zh_cn: 她兴奋的咳着，捡起一根附着枯叶的树枝，旗子一样挥舞着。

source: Caroline wonders if the brown boots are pinching.
zh_cn: Caroline在想这双棕色的靴子是不是有点夹脚。

source: She thinks of Chinese ladies with their ghastly little feet.
zh_cn: 她想到中国裹脚女人的小脚。

source: For winter she could always line that thin coat with a flannel petticoat of her own ... but then it mightn't button up at the front.
zh_cn: 冬天她可以就穿自己的法兰绒衬裙加薄外套......但这样前面就扣不上扣子。

source: "Birdies! Mamma, birdies!"
zh_cn: “小鸟！妈妈，小鸟！”

source: "That's right, pretty birdies."
zh_cn: “是啊，漂亮的小鸟。”

source: A spattering of rain.
zh_cn: 雨水四溅。

source: On the way home, they pass two women on a bench, whose conversation halts.
zh_cn: 回家路上，她们路过长椅时，坐在那的两个女人突然停止了谈话。

source: Eyes flicker, then avert.
zh_cn: 眼神漂移，然后扭开了。

source: The chat starts up again in graver tones.
zh_cn: 然后再用更低沉的语调开始聊起来。

source: Does Caroline hear her name?
zh_cn: Caroline好像听到了自己的名字？

source: She keeps her gaze at the level of her daughter's face.
zh_cn: 她一直看着女儿的脸庞。

source: "Look, a snail," she remarks inanely.
zh_cn: “看，蜗牛，”她傻呼呼的说。

source: "Nail," echoes Pet, bending to examine it.
zh_cn: “蜗牛”Pet重复着，弯下腰看着。

source: But her mother jerks her hand.
zh_cn: 但是她妈妈拉了拉她的手。

source: "On we go, the rain's coming."
zh_cn: “咱们走，要下雨了。”

source: Caroline doesn't care, not for herself.
zh_cn: Caroline一点不在乎，自己这点事不算什么。

source: There's an automatic searing of the cheeks, at moments like these; occasionally on waking, a leaden sense of her fate that presses her against the pillow.
zh_cn: 这种时候她总会不自觉的脸红；还有时一醒来，想到自己沉重的命运，就不想起来。

source: But no shame.
zh_cn: 但不觉得羞耻。

source: What time in her day has she for shame?
zh_cn: 她什么时候觉得羞耻过？

source: "Nail," cries Pet again, squatting to reach for something that looks very much like dog dirt.
zh_cn: “蜗牛，”Pet再次喊道，蹲下试图捡起一块很像狗屎的东西。

source: "Time for cocoa," says Caroline, hauling her onto her hip with one arm.
zh_cn: “该喝可可了，”Caroline说道，一手把她抱起来。

source: Fallen.
zh_cn: 堕落。

source: It's not like in the novels, or on the stage; it's as ordinary as darning.
zh_cn: 并不像小说一般，也不像舞台剧。就像缝补一样，再平常不过。

source: What has Caroline ever done but what she had to, since she was nineteen and she found herself alone with a nine-year-old brother to raise?
zh_cn: 与其追究Caroline的所作所为，不如想想自19岁就剩她孤身一人抚养9岁的弟弟，一切不都是不得已而为之么？

source: The road never seemed to fork.
zh_cn: 她的路从来就不曾分叉过。

source: She's put one foot in front of the other and this is where they have led her, this moment, fat drops of rain falling into her collar as she rushes along the blotched footpath with Pet laughing on her hip.
zh_cn: 她只是一步一步的向前，随脚步走至今日，当下，硕大的雨点打入领口，她在斑驳的人行道上跑着，Pet在她怀里笑着。

source: Onward, onward, because backward is impossible.
zh_cn: 向前，再向前，因为后退已经不可能了。

source: Fallen, like leaves that can't be stuck back on the trees again.
zh_cn: 堕落啊，就像落叶一样，不可能回到树上了。

source: And it strikes Caroline now that everything the child learns is a step closer to misery.
zh_cn: 想到女儿每日所学，离悲剧越来越近，Caroline就倍受打击。

source: When will Pet begin to register the neighbors' words?
zh_cn: 还有多久Pet就能听懂邻居的话了啊？

source: At four?
zh_cn: 四岁？

source: Five?
zh_cn: 五岁？

source: Coming home with her face streaked with knowledge: I heard a bad word.
zh_cn: 不安的回到家说着：我听到了坏话。

source: Cruel misnamings of what she is, or rather, what her mother is; the falsity of fact.
zh_cn: 别人给她起残忍的绰号，抑或是给她妈妈起的；歪曲事实的绰号。

source: And what will Caroline tell her then?
zh_cn: Caroline能跟她怎么说呢？

source: What fiction, what feeble justification?
zh_cn: 都是瞎编的，还是别的毫无说服力的借口？

source: She wishes absurdly that Pet would stay light enough to carry on her hip; would shrink, in fact, falling back month by month into the plump oblivion of infancy.
zh_cn: 她内心扭曲的希望Pet能永远被她抱在怀里；甚至越变越小，变回胖嘟嘟的婴儿。

source: At home, the afternoon goes smoothly: a small mercy.
zh_cn: 家中，下午缓缓而过：这小小的慰藉。

source: The girl takes Pet up for a nap, while Caroline glances at yesterday's paper.
zh_cn: 女佣带Pet上楼小睡，Caroline扫了一眼昨天的报纸。
